{
 "_liked_by": "[\"Administrator\"]",
 "absolute_value": 0,
 "align_labels_right": 0,
 "creation": "2024-08-01 13:25:20.598619",
 "css": ".font{\n    font-size: 15px;\n}\n.sectiontable{\n    margin: 2rem 2rem !important;\n}",
 "custom_format": 1,
 "default_print_language": "en",
 "disabled": 0,
 "doc_type": "Appointment Letter",
 "docstatus": 0,
 "doctype": "Print Format",
 "font_size": 14,
 "html": "{% set employee = frappe.get_doc('Employee', doc.custom_employee) %}\n\n\n<!--Fetch Company Address-->\n{% set child_table_field_name = 'link_name' %}\n{% set target_link_name = doc.company %}\n\n{% set parent_docs = frappe.db.sql(\"\"\"\n    SELECT parent FROM `tabDynamic Link`\n    WHERE {child_table_field_name} = %s\n\"\"\".format(child_table_field_name=child_table_field_name), target_link_name, as_dict=True) %}\n\n{% set address_doc_name = parent_docs[0]['parent'] if parent_docs else None %}\n\n{% set address_doc = frappe.get_doc('Address', address_doc_name) %}\n\n{% if address_doc -%}\n    {% set address_line_1 = address_doc.address_line1 %}\n    {% set address_line_2 = address_doc.address_line2 %}\n    {% set city = address_doc.city %}\n    {% set state = address_doc.state %}\n    {% set country = address_doc.country %}\n{%- endif %}\n\n{% set address_line = address_line_1 + ', ' +  address_line_2 + ', ' + city + ', ' + state + ', ' + country%}\n\n\n\n\n\n<h1 align='center'><b>Work Practice Agreement</b></h1>\n\n<section class='sectiontable' style='text-align: justify;'>\n<div class='font'>\n    An agreement arrived between the Company Name  hereafter referred to be {{ doc.company or '' }} having its registered office at {{ address_line or '' }}  and \n    {% if employee.gender=='Male' -%}\n        Mr.\n    {%- endif %}\n    {% if employee.gender=='Female' -%}\n        Ms.\n    {%- endif %}\n    {{ doc.custom_employee_name or '' }} (The Employee), resident of {{ employee.current_address or '' }}\n    \n    <br><br>\n    <p align='center' style='font-size:17px; font-weight: 400px;'><b>Terms of Agreement</b></p>\n    \n    <p>That, this agreement is executed to ensure integrity liability and norms of discipline by the employee concern  to prevent and protect company’s  property equipments and business interest arising from the vulnerability due to the indispensible access to the invaluable information/properties of the company.\n    </p><br>\n    <ol>\n        <li>\n            That the employee during the continuation of his services,  will not indulge himself, directly or indirectly, either alone or jointly or on behalf of others, in any activity, assignment, profession or occupation wholly or part time during working hours or after working hours  giving him direct or indirect remuneration. The employee will also not have any direct or indirect financial interest in the actual or future business of the company.\n        </li><br>\n        <li>\n            That the employee shall maintain the highest standards of integrity in his  work and will not engage or  divulge  or  disclose  any  secret  or  information  of  the  company affairs  or  business  or furnish material information to anyone or discuss the affairs of the company with anyone. He also must understand that confidential information means any proprietary information, technical data, trade secret, know how, product plans, services, customer lists, formulae, designs, and configuration, password and IP records of the company.\n        </li><br>\n        <li>\n            That since most ideal work ethics are prevalent in business of the company , the employee will not indulge in any activity either while being on work or on tour for official work which can be termed as an act of moral turpitude or immoral activity inclusive of behavioral or sexual harassment as termed in workplace Sexual Harassment Act.\n        </li><br>\n        <li>\n            That employee  shall  not  engage  himself  either  directly  or  indirectly  in  any  sort  of  money  dealing with any employee, dealer, agent or representative of other company/customer  so  long  as  he remain  in  employment of the company. The employee will also ensure that  neither he nor any employee associated with him for completion of assignments never  accept any illegal gratification in terms of money or kind inclusive of any gift/favor of comforts from any other company/customer.\n        </li><br>\n        <li>\n            That the employee will not indulge in any activity or will not instigate any other employee to strike work (resort to strike), go slow, Sabotage to the property/ instruments, equipments of the company/customer. However in case it is observed that employee directly or indirectly, expressly or impliedly  is involved , this will be considered to be an act of gross misconduct and his services may be liable to be terminated forthwith as all such stoppage of work /act of indiscipline shall be considered to be illegal and unjustified. The employee will not initiate or involve himself in formation of any union/ association, committee or to create any group of employees and any such effort shall be considered to be an act of serious misconduct.\n        </li><br>\n        <li>\n            That any such act on the part of employee proved to be subversive to the disciplinary norms, work ethics, business interest of the company/customer shall be taken seriously by the management and make him liable for strict disciplinary action.\n        </li><br>\n        <li>\n            That the employee shall follow all applicable safety measures, instructions & standards regarding his work and shall be responsible for all subsequent damage in case of failure on his part in observing the safety measures, instructions & standards. That any accident happened because of not following safety rules/ instruction or not using PPEs, will be employee’s responsibility.\n        </li><br>\n        <li>\n            That the employee will keep his workplace neat & clean to extend support to management’s 5s Mission.\n        </li><br>\n        <li>\n            That the management of the company has prohibited smoking, alcohol consumption and use of tobacco products and chewing pan/masala at all work places, the employee will strictly observe it. For any violation if observed the company shall have the right to penalize or take strict disciplinary action against the employee.\n        </li><br>\n        <li>\n            That the disorderly behavior of employee will not be acceptable as the company believe in cordial work culture and work place discipline.\n        </li><br>\n        <li>\n            That the employee will never interfere company’s business activities and shall concentrate on his job assigned to him from time to time.\n        </li><br>\n        <li>\n            That the employee will always abide by justified orders of all those supervisors/ authorities who will be authorized by the company to supervise/audit his work and will never indulge in any uncalled for arguments.\n        </li><br>\n        <li>\n            That the Corporate etiquettes of the company are defined and the employee will adhere to them. “Handholding” is the culture of the company and the employee will cooperate to this mission.\n        </li><br>\n        <li>\n            That the employee will not think and act proved to be prejudicial to the discipline, industrial peace and laid down norms of work for employees of the company.\n        </li><br>\n        <li>\n            That the employee will not cause any harm physically or mentally to any employee of the company individually/jointly or severally, directly or indirectly, expressly or impliedly as this may lead to be booked to him under criminal offence besides disciplinary action by the management leading to even dispensing with the services.\n        </li><br>\n        <li>\n            That the employee will behave and deal with other employees courteously and honorably and will not make use of harsh and abusive language while being on work or thereafter.\n        </li><br>\n        <li>\n            That the employee will not initiate any legal action / litigation against the company or any of its employees in any court of law and will prefer to resolve all the issues amicably.\n        </li><br>\n        <li>\n            That the official guests, visitors, clients, company representatives should be honorably dealt with, as employee’s non cooperation and odd behavior will reflect to company’s business interest. \n        </li><br>\n        <li>\n            Official guest/ visitors/ client/ vendor after approaching the office will get in touch with receptionist on 1st Floor, who inturn will contact the concern officer and on his approval shall send the guest/visitor/ client/ vendor to meeting place. Meeting will be only at either reception or conference/meeting rooms. In no case guest/ visitor/ client/ vendor will be allowed to go to workplace.\n        </li><br>\n        <li>\n            That the employee will comply with all statutory compliances and applicable laws rules and regulations, standing orders, work instructions as applicable at company’s designated place of work.\n        </li><br>\n        <li>\n            That the employee concern will present him on duty in formal attire/ uniform even if not provided by the company and will not commit an act which put image of the company in  disrepute.\n        </li><br>\n        <li>\n            That the employee’s workplace will exhibit his mindset hence the employee will make sure it is always presentable and safe to visit.\n        </li><br>\n        <li>\n            That the electronics equipments inclusive of mobile phones desktops and laptops should be judiciously used and safely maintained and should not be used by the employee for the personal work.\n        </li><br>\n        <li>\n            That the stationery provided to employee is for official use and should not be taken away for personal use.\n        </li><br>\n        <li>\n            That the working hours as scheduled should be optimally utilized for official business and no span of it should be wastefully spent as the assignments entrusted to the employee need to be completed   within the given time limit.\n        </li><br>\n        <li>\n            That the employee will always keep his database and MIS updated so as to provide the required documentation / information without loss of time for taking fast decisions.\n        </li><br>\n        <li>\n            That the all records, equipments and documents shall be required to be maintained and stored neatly in safe custody to avoid excess of any one to temper with.\n        </li><br>\n        <li style='page-break-before: always;'>\n            That the employee will not issue any communication on behalf of the company to any internal or external agency, person, contractor, customer or agent of any company unless there is an official written authorization to this effect by any competent authority.\n        </li><br>\n        <li>\n            This will be endeavor of employee to align his acts, actions functions to the core values of the company.\n        </li><br>\n        <li>\n            That infringement of any of the clauses or conditions mentioned in this agreement, at any point of time, shall make the employee liable for legal action/damages. Any dispute arising out of the aforesaid terms and conditions of the Agreement , at first instance will be tried to be resolved amicably, however if required shall be referred to Managing director  Who will hear both the parties and his decision shall be final & binding upon all concerned.\n        </li><br>\n        <li>\n            That the language used in this Agreement is the language chosen for the sake of clarity to express the mutual intent, and no rules of strict construction will be applied.\n        </li><br>\n    </ol><br>\n    \n    <p>In witness where of this agreement has been executed at \n    {% for row in doc.terms %}\n        {% if row.title == \"Venue of Arbitition\" %}\n            {{ row.description or ''}}\n        {% endif %}\n    {% endfor %}\n    on {{ frappe.utils.get_datetime(frappe.utils.today()).strftime('%d-%m-%Y') or '' }}\n    and signed the same by both the parties, in token of acceptance of the terms herein above contained.</p>\n    \n</div><br><br>\n\n\n\n<div align='left' class='font'>\n    <table style='margin-top: 100px; width: 100%;'>\n        <tr>\n            <td style=\"width: 50%; vertical-align: top;\">\n                <p><b>Employee Name: </b>{{ doc.custom_employee_name }}</p>\n                <p><b>Employee Code: </b>{{ doc.custom_employee }} </p>\n                <p><b>Designation: </b>{{ doc.custom_designation }} </p>\n                <p><b>Place: </b></p>\n                <p><b>Date: </b>{{ frappe.utils.get_datetime(frappe.utils.today()).strftime('%d-%m-%Y') or '' }}</p>\n            </td>\n            <td style=\"text-align: right; vertical-align: top;\">\n                <p><b>For {{ doc.company or '' }}</b></p><br><br><br>\n                <p><b>Authorized Signatory</b></p>\n            </td>\n        </tr>\n    </table>\n</div>\n\n</section>",
 "idx": 0,
 "line_breaks": 0,
 "margin_bottom": 15.0,
 "margin_left": 15.0,
 "margin_right": 15.0,
 "margin_top": 15.0,
 "modified": "2024-08-05 13:12:01.038339",
 "modified_by": "Administrator",
 "module": "Mumal HR",
 "name": "Work Practice Agreement",
 "owner": "Administrator",
 "page_number": "Hide",
 "print_format_builder": 0,
 "print_format_builder_beta": 0,
 "print_format_type": "Jinja",
 "raw_printing": 0,
 "show_section_headings": 0,
 "standard": "Yes"
}