{
 "_liked_by": "[\"Administrator\"]",
 "absolute_value": 0,
 "align_labels_right": 0,
 "creation": "2024-08-01 13:25:20.440761",
 "css": ".font{\n    font-size: 17px !important;\n}\n\n.sectiontable{\n    margin: 2rem 8rem !important;\n}\n\n.center-align {\n    text-align: center;\n}\n\n.fixed-height {\n    height: 7px;\n}\n\n.head{\n    font-size: 12px !important;\n}\n\n.total{\n    background-color: #f4f5f6;\n}",
 "custom_format": 1,
 "default_print_language": "en",
 "disabled": 0,
 "doc_type": "Appointment Letter",
 "docstatus": 0,
 "doctype": "Print Format",
 "font_size": 14,
 "html": "{% set employee = frappe.get_doc('Employee', doc.custom_employee) %}\n\n{% if letter_head and not no_letterhead -%}\n    {% if print_settings.repeat_header_footer %}\n        {{ letter_head }}\n    {%- endif %}\n{%- endif %}\n\n<h4 align='center'>APPOINTMENT LETTER</h4>\n\n<div align='left' class='font'>\n    <p>Date: {{frappe.utils.get_datetime(doc.appointment_date ).strftime('%d-%m-%Y') or ''}}</p>\n    <p>{{ doc.custom_employee_name or '' }}</p>\n    <p style='width: 250px;'>{{ employee.current_address or ''}}</p><br>\n    <p>Subject: Appointment Letter</p>\n    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Please refer your application for employment in the company and subsequent discussions we had, we are pleased to appoint you as {{ doc.custom_designation or '' }}. </p>\n    <p>As per our record your date of joining is \n        {% for row in doc.terms %}\n            {% if row.title == \"Date of Joining\" %}\n                {{ row.description or ''}}\n            {% endif %}\n        {% endfor %}.\n    </p><br>\n    <p> The following terms & conditions are:</p>\n    <p>The detail of your C.T.C. shall be as per Annexure – 1.</p>\n    <ol>\n        <li>\n            The details of your compensation shall be subject to deduction of income tax as per the prevailing income tax rates and other statutory deduction, as may be required in accordance with applicable laws in force from time to time.\n        </li>\n        <li>\n            Your compensation may be revised from time to time in accordance with company's policies. The increments & promotions are subject to merit & performance of the employee which will be at the sole discretion of the management.\n        </li>\n    </ol>\n</div>\n\n<div class='font'>\n    <ol>\n        <br><b>◆ Probation, Confirmation & Separation:</b>\n    </ol>\n    <ol>\n        <li>Initially you will be on probation for a period of \n            {% for row in doc.terms %}\n                {% if row.title == \"Probation/Training Period\" %}\n                    {{ row.description or ''}}\n                {% endif %}\n            {% endfor %}\n            from the date of joining the company and your confirmation thereafter would be in writing and would depend on your satisfactory performance, else you would continue in probation till such time as your services are either confirmed in writing or terminated as per clauses below. \n        </li><br>\n        \n        <li>\n            Once confirmed, unless the employment is terminated earlier, you shall continue to be in the employment of the company up till attainment by you of the age of superannuation, as set out in the company policy from time to time, which at present is \n            {% for row in doc.terms %}\n                {% if row.title == \"Retirement Age\" %}\n                    {{ row.description or ''}}\n                {% endif %}\n            {% endfor %}\n            . your superannuating age will be calculated against the date of birth proof submitted at the time of joining the company.\n        </li><br>\n        \n        \n        <li>\n            During the probation either party may terminate the service by (i) giving \n            {% for row in doc.terms %}\n                {% if row.title == \"Notice Period\" %}\n                    {{ row.description or ''}}\n                {% endif %}\n            {% endfor %}\n            written notice; or (ii) payment in lieu of notice to be paid by the party terminating the services to the non-terminating party.\n        </li><br>\n        \n        <li>\n            Post confirmation, either party may terminate the services by (i) giving \n            {% for row in doc.terms %}\n                {% if row.title == \"Notice Period\" %}\n                    {{ row.description or ''}}\n                {% endif %}\n            {% endfor %}\n            written notice; or (ii) payment in lieu of notice to be paid by the party terminating the services to the non-terminating party.\n        </li><br>\n        \n        \n        <!--Footer-->\n        <div align='right' style='page-break-after: always;padding-top:100px;'>\n            <h4 style='font-weight: 50px;'>(ACCEPTED SIGNATURE)</h4>\n            <h4 style='font-weight: 50px;'>{{ doc.custom_employee_name or '' }}</h4>\n        </div>\n        \n        \n        <!--Header-->\n        {% if letter_head and not no_letterhead -%}\n            {% if print_settings.repeat_header_footer %}\n                {{ letter_head }}\n            {%- endif %}\n        {%- endif %}\n        \n        <li>\n            In case of notice, if you have been reimbursed to you (defray deduction of notice pay by your previous employer at the time of joining, owing to shortfall in notice period caused due to urgency in joining the company), you will be required to refund the entire amount so reimbursed to you, in case you resign from the services of the company within \n            {% for row in doc.terms %}\n                {% if row.title == \"Resignation Duration from Employment\" %}\n                    {{ row.description or ''}}\n                {% endif %}\n            {% endfor %}\n            of your joining.\n        </li><br>\n        \n        <li>\n            It is clarified that the company reserves the right to either to accept or to deny, at its sole discretion, the payment in lieu of notice period, if so requested by you, both during probation period and post confirmation, and may ask the employee to serve the full notice period.\n        </li><br>\n        \n        <li>\n            Your final relieving from the employment shall be subject to (i) Satisfactory handover of the duties and all information and documents pertaining to your work to the company's representative or the employee's successor; (ii) settlement of outstanding dues payable from you to the company;(iii) service of notice period or payment in lieu thereof, as the case may be; and (iv) clearance from your immediate supervisor and such other departments as may be prescribed in the company policy.\n        </li><br>\n        \n        <li>\n            <b>Termination for Cause:</b> The Company reserves the right to terminate your employment immediately without giving a notice period of service or payment in lieu of notice period in case reason for the same exists ('Termination for Cause'), which circumstances include but are not limited to : (i) any violation of the terms and conditions of employment as contained in the letter or as contained in any of the rules, regulations and policies of the company, as shall be amended from time to time;(ii) in case the company : finds you guilty of misconduct, dishonesty or acting in a manner prejudicial to or conflicting with the interests of the company; and (iii)in case you absent yourself from the services of the company without prior approval or overstay sanctioned leave without prior intimation and approval by \n            {% for row in doc.terms %}\n                {% if row.title == \"Absent Limitation Without Prior Approval\" %}\n                    {{ row.description or ''}}\n                {% endif %}\n            {% endfor %}\n            in this case you will be deemed to have abandoned services voluntarily and shall have to pay to the company payment in lieu of notice.(iv) found to have engaged in any other act or omission, inconsistent with the employee's duties (v) Violated lawful orders given to the employee by the company.(vi)convicted of any criminal offences. (vii)violated conduct rules of the company framed/modified from time to time. (viii) If any of the information is concealed or the employee provide false/ incorrect information (ix) If found engaged in any action that interferes with the best interests of the company. This includes any situation involving a conflict of interest (especially financial interest), which could affect the company's reputation, competitive position, future growth or financial standing. You shall conduct yourself with utmost discretion.  \n        </li>\n        \n    </ol>\n</div>\n\n<div class='font'>\n    <ol>\n        <br><b>◆ Actions Upon Ending of Employment:</b>\n    </ol>\n    <ol>\n        <li>\n           In the event your retirement (upon attaining the age of superannuation), separation or termination of your employment by the company for any reason whatsoever you will promptly return to the company, all documents, files, notes, lists, credit cards, keys, computer, disks, recordings, print- outs, any other assets (including, without limitations, any materials reflecting or containing confidential information) that are in your possession or under your control and that relate to the operation and business of the company. you shall not be entitled to retain any duplicates or summaries of or notes on any of the foregoing.\n        </li>\n        \n        <!--Footer-->\n        <div align='right' style='page-break-after: always;padding-top:50px;'>\n            <h4 style='font-weight: 50px;'>(ACCEPTED SIGNATURE)</h4>\n            <h4 style='font-weight: 50px;'>{{ doc.custom_employee_name or '' }}</h4>\n        </div>\n        \n        <!--Header-->\n        {% if letter_head and not no_letterhead -%}\n            {% if print_settings.repeat_header_footer %}\n                {{ letter_head }}\n            {%- endif %}\n        {%- endif %}\n        \n        <p><b>LEAVE:</b></p>\n        <li>\n            You will be governed by the company's leave policy in force and as applicable to your category of employees from time to time.\n        </li><br>\n        \n        <p><b>TRAVELLING:</b></p>\n        <li>\n            In the course of your employment, you may be required to travel to domestic and foreign location's in connection with the company's business, according to the directions and instructions issued by the management, from time to time, for which you will be reimbursed expenses in accordance with the relevant travel policies.\n        </li><br>\n        \n        <p><b>TRANSFER:</b></p>\n        <li>\n            Your services are liable to be transferred, as per company policy, to any other associate or affiliate entity of the company and such transfer can be to any other location, It is understood and agreed that the company shall have the right to transfer/second you, as the case may be, to any function or business group, any other location within, or to its affiliate and subsidiary organization, at any time in the future whether present or set up in future.\n        </li>\n    </ol>\n</div>\n\n<div class='font'>\n    <ol>\n        <br><b>◆ Confidentiality & Non-Disclosure:</b>\n    </ol>\n    <ol>\n        <li>\n            You agree that during your employment you may have access to or acquire, through the company, its employees, clients, vendors, service providers etc. various kinds of information pertaining, amongst others, to the business, employees, clients and other stakeholder of the company and that all such information (\"Confidential Information\") shall be treated as confidential and shall not be disclosed by you to any third party or even other employees of the company ,Disclosure of confidential information to other employees of the company shall be purely on  a need to know basis. you should refrain from sharing any information whether words, images, logos or videos that is confidential or proprietary to the company through any mode of media, including public newspaper, journal, television channels, online media, news channel or otherwise. You shall not release/ disclose on media, any internal communication intended solely for the information of all employees of the company nor shall you associate yourself with any group or entity engaging in such activities without the prior approval of the management. you shall not publish or communicate, in any manner, any derogatory or defamatory content about the company, its associates, affiliates, management or other employees. you understand and agree that you have a continuing obligation not to use, publish or otherwise disclose either during or after your employment with the company, any trade secrets, confidential or proprietary information belonging to, or concerning or referring to the company, or any client or customer of the company. you acknowledge that should you breach this provision, the company will suffer immediate and irreparable harm and that money damages will be inadequate relief and therefore, you agree that should you breach this provision; the company will be entitled to injunctive relief to enforce the provisions contained herein.\n        </li><br>\n        \n        \n         <!--Footer-->\n        <div align='right' style='page-break-after: always;padding-top:100px;'>\n            <h4 style='font-weight: 50px;'>(ACCEPTED SIGNATURE)</h4>\n            <h4 style='font-weight: 50px;'>{{ doc.custom_employee_name or '' }}</h4>\n        </div>\n        \n        <!--Header-->\n        {% if letter_head and not no_letterhead -%}\n            {% if print_settings.repeat_header_footer %}\n                {{ letter_head }}\n            {%- endif %}\n        {%- endif %}\n        \n        <li>\n            During the continuance of your employment with the company and therefore, any process, practice, discovery or invention developed or acquired by you in the course of discharging of the assigned duties, shall remain the sole property of the company and same shall not to be used in any manner whatsoever by you without the specific knowledge and express permission of the company, post cessation of your employment with the company, and you hereby assign all rights, title and interest in such invention to the company and agree to help the company to perfect its title to the same. In case during the tenure of employment in the company or even thereafter if you develop, innovate any new products, technology, knowhow, software, design, or any other improved version of the product, the company will have the exclusive rights of IPR and you or group of employee associated with any such research, innovation or improvement will not have any right to patent or get registered in their personal name or title.\n        </li><br>\n        \n        <li>\n            During the period of your employment with the company and for a period of \n            {% for row in doc.terms %}\n                {% if row.title == \"After Resignation Period\" %}\n                    {{ row.description or ''}}\n                {% endif %}\n            {% endfor %}\n            thereafter you agree you shall not, whether directly or indirectly, induce or solicit any person employed or engaged by the company or its affiliate companies (whether as an employee, consultant, advisor or in any other manner) to terminate their contractual relationship with the company; and become an employee of, or directly or indirectly offer services in any form or manner to any other company, person or entity. you shall keep the company indemnified in respect of any loss that may be caused to it as a result of breach of this covenant by you.\n        </li><br>\n        \n        <li>\n            During the period of your employment with the company and for a period of \n            {% for row in doc.terms %}\n                {% if row.title == \"After Resignation Period\" %}\n                    {{ row.description or ''}}\n                {% endif %}\n            {% endfor %}\n            thereafter you agree that you shall not, whether directly or indirectly, solicit or induce any customer to remove its business from or reduce its business with the company or its affiliates you will abide by & sign intellectual property right clause being legally binding on employees of the company.\n        </li><br>\n        \n        <li>\n            On cessation of employment with the company you shall not join competitor company from the same or similar industry for a period of \n            {% for row in doc.terms %}\n                {% if row.title == \"After Resignation Period\" %}\n                    {{ row.description or ''}}\n                {% endif %}\n            {% endfor %}\n            from the date of cessation of the employment.\n        </li>\n    </ol>\n\n</div>\n\n<div class='font'>\n    <ol>\n        <br><b>◆ Company's rules, regulations and policies:</b>\n    </ol>\n    <ol>\n        <li>\n            The company reserve the right to change the terms of employment from time to time.\n        </li><br>\n        \n        <li>\n            You will be bound by the various rules, regulation & policies of the company as are existing on the date and as shall be amendment by the management from time to time and the same hour deemed to be part of your terms & condition of employment. You are required to follow the company's values and code of conduct and other policies and these include a requirement that you maintain the highest standard of conduct and act with the highest ethical principles.\n        </li><br>\n        \n        <li>\n            Any violation at the terms & conditions as contained in this letter and the company's rules, regulations & policies can render your employment will be terminated.\n        </li><br>\n        \n        \n        <!--Footer-->\n        <div align='right' style='page-break-after: always;padding-top:100px;'>\n            <h4 style='font-weight: 50px;'>(ACCEPTED SIGNATURE)</h4>\n            <h4 style='font-weight: 50px;'>{{ doc.custom_employee_name or '' }}</h4>\n        </div>\n        \n        <!--Header-->\n        {% if letter_head and not no_letterhead -%}\n            {% if print_settings.repeat_header_footer %}\n                {{ letter_head }}\n            {%- endif %}\n        {%- endif %}\n        \n        <li>\n            While you are being appointed in the current role and function, you may be called upon to perform such other duties or take on such other responsibilities in the interest of the business and priorities of the company, which the management believe are well within your capabilities and of which the management will be the sole judge. You will undertake to adapt new method of working with the use of modern or modified equipment, tools etc. Of work as dictated by the circumstances of the company's business in a competitive environment.\n        </li><br>\n        \n        <li>\n            Your continuances in the employment of the company is subject to your remaining physical and mentally fit for the purpose of the job.as and when required by the management, you will submit yourself for medical examination by a doctor appointed by acomp0any for the purpose.\n        </li><br>\n        \n        <li>\n            During the course of your employment with the company you shall not take up any other employment or activity, weather for or without consideration, that may be a conflict which your responsibility as an employee of the company and shall devote your full time and attention to the employment with the company. Amongst the other you will not contest any election to legislature or local body without the previous permission of the employer.\n        </li><br>\n        \n        <li>\n            You will keep us informed of any changes in your residential address (current & permanent), or any other particulars relevant to your employment. Unless change is intimated in writing to the company, address given by you in the application shall be deemed to the address for communication.\n        </li><br>\n        \n        <li>\n            You give your consent & irrevocable authorization to the company (i) to share and disclose the information relating to your current and previous employment and academic credentials with any person, venders or any other authorities or any third party engaged by the company for the purpose of proper background check and verification during and after your employment (ii) to provide a reference check covering your employment with the company, including sharing the cause of your exit from the company to any third party conducting a reference check on behalf of company or agency (iii) to share your details or any other information pertaining to your employment with any govt.  authority or agencies, pursuant to a request received for a same both during and post your exit from the company.\n        </li><br>\n        \n        <li>\n            During the employment, the employer may also ask you for proof of date of birth, education, prior employment document etc. which you shall submit within specified time as required by the company.\n        </li><br>\n        \n        <li>\n            The terms of this employment shall be governed by and construed in accordance with the Laws of the India. Any dispute arising between you and the company shall be resolved through arbitration by a sole arbitrator (Arbitration and conciliation Act) appointed by the company. The venue of arbitration shall be \n            {% for row in doc.terms %}\n                {% if row.title == \"Venue of Arbitition\" %}\n                    {{ row.description or ''}}\n                {% endif %}\n            {% endfor %}\n            . The courts in Udaipur will have jurisdiction in relation to and issue arising out of the said arbitration.\n        </li><br>\n        \n        <!--Footer-->\n        <div align='right' style='page-break-after: always;padding-top:100px;'>\n            <h4 style='font-weight: 50px;'>(ACCEPTED SIGNATURE)</h4>\n            <h4 style='font-weight: 50px;'>{{ doc.custom_employee_name or '' }}</h4>\n        </div>\n        \n        <!--Header-->\n        {% if letter_head and not no_letterhead -%}\n            {% if print_settings.repeat_header_footer %}\n                {{ letter_head }}\n            {%- endif %}\n        {%- endif %}\n        \n        \n        <li>\n            <ol type=\"i\">\n                <li>This appointment is contingent upon:\n                \n                    <ol type=\"a\">\n                        <li>\n                            Satisfactory results of the pre-employment medical checkup and satisfactory reference check, verification of educational qualification and past employment record\n                        </li>\n                        <li>\n                            All information, facts & figures provided by you to the company's representative at any point in time, being accurate in true.\n                        </li>\n                        <li>\n                            Your acceptance of the about terms & condition.\n                        </li>\n                    </ol>\n                </li>\n                \n                <li>\n                    The company reserves the right to terminate your employment forthwith, without any notice period or payment in view of notice, in case any information provided by you or your references turn out to be false or incorrect.\n                </li>\n                \n                <li>\n                    You are required to provide us a copy of this appointment letter signed by you as a token of your acceptance\n                </li>\n            </ol>\n            \n        </li>\n        \n    </ol><br><br>\n    \n    <p>We wish you an Enjoyable and Rewarding Association with us.</p><br><br>\n    \n    <p>Your Sincerely,</p><br><br><br>\n    \n    <p>{{ doc.company or '' }}</p>\n    \n    <!--Footer-->\n    <div align='right' style='page-break-after: always;padding-top:570px;'>\n        <h4 style='font-weight: 50px;'>(ACCEPTED SIGNATURE)</h4>\n        <h4 style='font-weight: 50px;'>{{ doc.custom_employee_name or '' }}</h4>\n    </div>\n</div>    \n\n <!--Header-->\n{% if letter_head and not no_letterhead -%}\n    {% if print_settings.repeat_header_footer %}\n        {{ letter_head }}\n    {%- endif %}\n{%- endif %}\n    \n<!--Salary Breakup-->\n<section class=\"sectiontable font\">\n    <table border=\"1\" width=\"100%\">\n       <tr>\n           <td colspan=\"2\" class=\"center-align\"><b>ANNEXURE-1</b></td>\n       </tr>\n       <tr>\n           <td style='font-size:15px'><b>Name Of The Employee</b></td>\n           <td style='font-size:15px'>{{ doc.custom_employee_name or \"\" }}</td>\n       </tr>\n       <tr>\n           <td style='font-size:15px'><b>Employee ID</b></td>\n           <td style='font-size:15px'>{{ doc.custom_employee or \"\" }}</td>\n       </tr>\n       <tr>\n           <td style='font-size:15px'><b>Designation</b></td>\n           <td style='font-size:15px'>{{ doc.custom_designation or \"\" }}</td>\n       </tr>\n       <tr class=\"fixed-height\">\n           <td colspan=\"2\"></td>\n       </tr>\n       \n       {% if doc.custom_earnings %}\n            <tr class=\"head\">\n               <td colspan=\"2\" class=\"left-align\" style='font-size:15px'><b>Earnings :</b></td>\n           </tr>\n            {% for item in doc.custom_earnings %}\n                <tr>\n                    <td style='font-size:15px'>{{ item.component or \"\" }}</td>\n                    <td style='font-size:15px'>{{ item.get_formatted(\"amount\") or \"\" }}</td>\n                </tr>\n            {% endfor %}\n            <tr class=\"total\">\n               <td style='font-size:15px'><b>Gross Salary</b></td>\n               {% set currency = employee.salary_currency %}\n               {% set symbol = frappe.db.get_value(\"Currency\", currency, \"symbol\") %}\n               {% set total_earnings = doc.custom_earnings | sum(attribute='amount') %}\n               <td style='font-size:15px'><b>{{ symbol }} {{ \"{:,.2f}\".format(total_earnings) }}</b></td>\n            </tr>\n        {% endif %}\n        \n        {% if doc.custom_deduction %}\n            <tr class=\"fixed-height\">\n               <td colspan=\"2\"></td>\n            </tr>\n            <tr class=\"head\">\n               <td colspan=\"2\" class=\"left-align\" style='font-size:15px'><b>Deductions :</b></td>\n           </tr>\n            {% for item in doc.custom_deduction %}\n                <tr>\n                    <td style='font-size:15px'>{{ item.component or \"\" }}</td>\n                    <td style='font-size:15px'>{{ item.get_formatted(\"amount\") or \"\" }}</td>\n                </tr>\n            {% endfor %}\n            \n            {% set total_deductions = doc.custom_deduction | sum(attribute='amount') %}\n               \n           </tr>\n           <tr class=\"total\">\n               <td style='font-size:15px'><b>Net Salary</b></td>\n               {% set net_salary = total_earnings - total_deductions %}\n               <td style='font-size:15px'><b>{{ symbol }} {{ \"{:,.2f}\".format(net_salary) }}</b></td>\n           </tr>\n        {% endif %}\n        \n        {% if doc.custom_benefits %}\n            <tr class=\"fixed-height\">\n               <td colspan=\"2\"></td>\n            </tr>\n            <tr class=\"head\">\n               <td colspan=\"2\" class=\"left-align\" style='font-size:15px'><b>Benefits :</b></td>\n           </tr>\n            {% for item in doc.custom_benefits %}\n                <tr>\n                    <td style='font-size:15px'>{{ item.component or \"\" }}</td>\n                    <td style='font-size:15px'>{{ item.get_formatted(\"amount\") or \"\" }}</td>\n                </tr>\n            {% endfor %}\n           <tr class=\"total\">\n               {% set total_benefits = doc.custom_benefits | sum(attribute='amount') %}\n               {% set ctc = net_salary + total_benefits + total_deductions %}\n               \n               <td style='font-size:15px'><b>Cost To Company (Monthly)</b></td>\n               <td style='font-size:15px'><b>{{ symbol }} {{ \"{:,.2f}\".format(ctc) }}</b></td>\n           </tr>\n        {% endif %}\n\n    </table>\n</section>\n\n<!--Footer-->\n<div align='right' style='page-break-after: always;padding-top: 165px;'>\n    <h4 style='font-weight: 50px;'>(ACCEPTED SIGNATURE)</h4>\n    <h4 style='font-weight: 50px;'>{{ doc.custom_employee_name or '' }}</h4>\n</div>\n    \n    \n    \n    \n    \n    \n    \n    \n    ",
 "idx": 0,
 "line_breaks": 0,
 "margin_bottom": 15.0,
 "margin_left": 15.0,
 "margin_right": 15.0,
 "margin_top": 15.0,
 "modified": "2024-08-05 13:12:01.101695",
 "modified_by": "Administrator",
 "module": "Mumal HR",
 "name": "Appointment Letter",
 "owner": "Administrator",
 "page_number": "Hide",
 "print_format_builder": 0,
 "print_format_builder_beta": 0,
 "print_format_type": "Jinja",
 "raw_printing": 0,
 "show_section_headings": 0,
 "standard": "Yes"
}